---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllDampers
source: html/b856c588-2a9d-fd34-4d4d-21ba8fcc1343.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllDampers Method

Gets all damper identifiers in the fabrication configuration.

## Syntax (C#)
```csharp
public IList<int> GetAllDampers()
```

## Returns
An array of specification identifiers.